#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# Xiang Wang @ 2020-10-26 20:29:15

https://leetcode-cn.com/problems/split-array-with-same-average/

[a, b, c, d, e] n个数
总和 s
平均值 s/n
B数组: [0, 1, 0, 1.. ]
C数组: [1, 0, 1, 0.. ]

考虑e在内.
1. d在内， 从 [a,b,c]里面找到 d + e + Choose(a,b,c) / 
2. d不在内

#
1个数: 有没有s/n
2个数: 有没有 a + b = s * s/n

#
1个数: 可能的解
2个数: 可能的解

#:
10000: S(1:30)
9999: 10000种可能

# 
[1, 2, 3, 4, ..] 500 [. , 899, 900, 901]

#
[1, 999, 2, 998, 3, 997, ... 500]

#
[1, 2, 3, 4, ... 899, 900, 901]
500,
1: 500
2: 1000,
3: 1500,

#
必定有个数组的数量 <= 500
500: 500 * 500
499: 500 * 499

#
[-500, -499, -498, ... , -1, 0, 1, 498, 499, 500]
f(a, x):  从前面a个元素里面找出n个元素，求和等于 -x
f(999, 0):
    # 499存在
    f(998, -499) ||
        # 498存在
        f(997, -499-498) ||
        # 498不存在
        f(997, -499)
    # 499不存在
    f(998, 0) ||


class 
